import { type ExtendedTable } from "../../type";

// Associate diacritics with existing glyph
const diaBaseAssociation = {
  // a
  á: ["a", ["ct"]],
  à: ["a", ["gr"]],
  ă: ["a", ["br"]],
  ắ: ["a", ["br", "ct"]],
  ằ: ["a", ["br", "gr"]],
  ẵ: ["a", ["br", "tl"]],
  ẳ: ["a", ["br", "ha"]],
  â: ["a", ["cr"]],
  ấ: ["a", ["cr", "ct"]],
  ầ: ["a", ["cr", "gr"]],
  ẫ: ["a", ["cr", "tl"]],
  ẩ: ["a", ["cr", "ha"]],
  ǎ: ["a", ["hc"]],
  å: ["a", ["gs"]],
  ǻ: ["a", ["gs", "ha"]],
  ä: ["a", ["dr"]],
  ǟ: ["a", ["dr", "mc"]],
  ã: ["a", ["tl"]],
  ȧ: ["a", ["gs"]],
  ǡ: ["a", ["gs", "mc"]],
  ą: ["a", ["cdr"]],
  ā: ["a", ["mc"]],
  ả: ["a", ["ha"]],
  ȁ: ["a", ["gr", "gr"]],
  ȃ: ["a", ["bri"]],
  ạ: ["a", ["db"]],
  ặ: ["a", ["br", "db"]],
  ậ: ["a", ["cr", "db"]],
  ḁ: ["a", ["db"]],
  ǽ: ["æ", ["ct"]],
  ǣ: ["æ", ["mc"]],
  ẚ: ["a", ["hcr"]],
  // b
  ḃ: ["b", ["da"]],
  ḅ: ["b", ["db"]],
  ḇ: ["b", ["lb"]],

  // c
  ć: ["c", ["ct"]],
  ĉ: ["c", ["cr"]],
  č: ["c", ["hc"]],
  ċ: ["c", ["da"]],
  ç: ["c", ["cd"]],
  ḉ: ["c", ["cd", "ct"]],
  ȼ: ["c", ["brd"]],
  ƈ: ["c", ["crs"]],
  // d
  ď: ["d", ["ct"]],
  ḋ: ["d", ["da"]],
  ḑ: ["d", ["cd"]],
  ḍ: ["d", ["db"]],
  ḓ: ["d", ["crb"]],
  ḏ: ["d", ["lb"]],
  ɖ: ["d", ["crs"]],
  // e
  ẹ: ["e", ["db"]],
  ẻ: ["e", ["ha"]],
  ẽ: ["e", ["tl"]],
  ế: ["e", ["cr", "ct"]],
  ề: ["e", ["cr", "gr"]],
  ể: ["e", ["cr", "ha"]],
  ễ: ["e", ["cr", "tl"]],
  ệ: ["e", ["cr", "db"]],

  ḙ: ["e", ["crb"]],
  ḛ: ["e", ["tlb"]],

  // f
  ḟ: ["f", ["da"]],

  // g
  ḡ: ["g", ["mc"]],

  // h
  ḣ: ["h", ["da"]],
  ḥ: ["h", ["db"]],
  ḧ: ["h", ["dr"]],
  ḩ: ["h", ["cdl"]],

  // i
  Ỉ: ["i", ["ha"]],
  Ị: ["i", ["db"]],

  // o
  ọ: ["o", ["db"]],
  ỏ: ["o", ["ha"]],
  ố: ["o", ["cr", "ct"]],
  ồ: ["o", ["cr", "gr"]],
  ổ: ["o", ["cr", "ha"]],
  ỗ: ["o", ["cr", "tl"]],
  ộ: ["o", ["cr", "db"]],
  ớ: ["o", ["hr", "ct"]],
  ờ: ["o", ["hr", "gr"]],
  ở: ["o", ["hr", "ha"]],
  ỡ: ["o", ["hr", "tl"]],
  ợ: ["o", ["hr", "db"]],

  // u
  ụ: ["u", ["db"]],
  ủ: ["u", ["ha"]],
  ứ: ["u", ["hr", "ct"]],
  ừ: ["u", ["hr", "gr"]],
  ử: ["u", ["hr", "ha"]],
  ữ: ["u", ["hr", "tl"]],
  ự: ["u", ["hr", "db"]],

  // y
  ỳ: ["y", ["gr"]],
  ỵ: ["y", ["db"]],
  ỷ: ["y", ["ha"]],
  ỹ: ["y", ["tl"]],
} as ExtendedTable;

export { diaBaseAssociation }
